app/views/books/index.html.erb

                        </th>
                        <th><%= book.book_comments.count %>コメント</th>
---
SELECT "books".* FROM "books"