app/controllers/books_controller.rb

   def ensure_correct_user
     @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def show
    @book = Book.new
    @booked = Book.find(params[:id])
    @user = User.find(@booked.user.id)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 9], ["LIMIT", 1]]

  def index
    #@user = User.find(current_user.id)
    #@user = User.find(params[:id])
    @book = Book.new
    @books = Book.all
---
SELECT "books".* FROM "books"

  def create
    @user = User.new(user_params)
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "vfejkg"], ["body", "vfhg"], ["user_id", 12], ["created_at", "2021-02-07 15:14:54.860352"], ["updated_at", "2021-02-07 15:14:54.860352"]]